Repository: MyCOMTechnologies/BitcoinMessageVerify
Catalog: Resources/Strings/AppResources.*.resx
Languages: de_de, it_it

# Wif
source: Wallet Import Format (WIF)
it_it: Formato di importazione del portafoglio (WIF)

# Mnemonic
source: Mnemonic Phrase
de_de: Mnemonische Phrase
it_it: Frase mnemonica

source: Bitcoin Address
de_de: Bitcoin-Adresse
it_it: Indirizzo Bitcoin

source: Sign Message
de_de: Nachricht unterschreiben
it_it: Firmare il messaggio

source: Signed Message
de_de: Unterschriebene Nachricht
it_it: Messaggio firmato

source: Message
de_de: Nachricht
it_it: Messaggio

source: Message is required
de_de: Nachricht ist erforderlich
it_it: Il messaggio è richiesto

source: Bitcoin Address is required
de_de: Bitcoin-Adresse ist erforderlich
it_it: L'indirizzo Bitcoin è richiesto

source: Mnemonic is required
de_de: Mnemonik ist erforderlich
it_it: La mnemonica è richiesta

source: Wif is required
de_de: WIF ist erforderlich
it_it: WIF è richiesto

source: Bitcoin Address is invalid
de_de: Bitcoin-Adresse ist ungültig
it_it: L'indirizzo Bitcoin non è valido

source: Wif is invalid
de_de: WIF ist ungültig
it_it: WIF non è valido

source: Mnemonic is invalid
de_de: Mnemonik ist ungültig
it_it: La mnemonica non è valida

# MnemonicWordCount
source: Mnemonic word count must be 12,15,18,21 or 24
de_de: Die Anzahl der Wörter in der mnemonischen Phrase muss 12, 15, 18, 21 oder 24 betragen.
it_it: Il conteggio delle parole mnemoniche deve essere 12, 15, 18, 21 o 24.

# SignedMessageCopied
source: Signed Message Copied to Clipboad
de_de: Unterschriebene Nachricht in die Zwischenablage kopiert
it_it: Messaggio firmato copiato negli appunti

# MnemonicExplanation
source: Mnemonic message signing uses the mnemonic phrase, a list of space-separated words, to derive the signing key. The Bitcoin address is validated to confirm its association with the signing key, and the message is then signed in accordance with the BIP-322 standard.
de_de: Die Nachrichtenunterzeichnung mit einer mnemonischen Phrase verwendet die mnemonische Phrase, eine Liste von durch Leerzeichen getrennten Wörtern, um den Signaturschlüssel abzuleiten. Die Bitcoin-Adresse wird validiert, um ihre Zuordnung zum Signaturschlüssel zu bestätigen, und die Nachricht wird dann gemäß dem BIP-322-Standard signiert.
it_it: La firma dei messaggi mnemonici utilizza la frase mnemonica, un elenco di parole separate da spazi, per derivare la chiave di firma. L'indirizzo Bitcoin viene validato per confermare la sua associazione con la chiave di firma e il messaggio viene quindi firmato in conformità con lo standard BIP-322.

# WifExplanation
source: WIF message signing uses the WIF to derive the signing key. The Bitcoin address is validated to confirm its association with the signing key, and the message is then signed in accordance with the BIP-322 standard.
de_de: Die WIF-Nachrichtensignierung verwendet das WIF, um den Signaturschlüssel abzuleiten. Die Bitcoin-Adresse wird validiert, um ihre Zuordnung zum Signaturschlüssel zu bestätigen, und die Nachricht wird dann gemäß dem BIP-322-Standard signiert.
it_it: La firma del messaggio WIF utilizza il WIF per derivare la chiave di firma. L'indirizzo Bitcoin viene convalidato per confermare la sua associazione con la chiave di firma e il messaggio viene quindi firmato in conformità con lo standard BIP-322.

# LedgerExplanation
source: Ledger message signing uses the Ledger Hardware Wallet to sign the message in accordance with the BIP-322 standard.
de_de: Die Nachrichtenunterzeichnung mit Ledger verwendet die Ledger-Hardware-Wallet, um die Nachricht gemäß dem BIP-322-Standard zu signieren.
it_it: La firma dei messaggi di Ledger utilizza il portafoglio hardware Ledger per firmare il messaggio in conformità con lo standard BIP-322.

source: Verify Message
de_de: Nachricht überprüfen
it_it: Verificare il messaggio

source: Proof of Ownership
de_de: Eigentumsnachweis
it_it: Prova di proprietà

# ValidationFailed
source: Message Validation Failed
de_de: Nachrichtenvalidierung fehlgeschlagen
it_it: La convalida del messaggio non è riuscita
